Repository: vishal8566/infoshare
Catalog: clients/module/Application/language/*.po
Languages: he_il

source: Search Data
he_il: חיפוש

source: Loan
he_il: הלוואה

source: Discounting
he_il: נכיון

source: Support
he_il: תמיכה

source: Reporting
he_il: דיווח

source: New Check Discounting
he_il: נכיון חדש

source: View Check Discounting
he_il: הצג נכיון

source: ID/LLC
he_il: ח.פ / ת.ז

source: Name
he_il: שם

source: Comments
he_il: הערות

source: Due Date
he_il: תאריך פרעון

source: Amount
he_il: סכום

source: Save
he_il: שמירה

source: Clear
he_il: נקה

source: BACK
he_il: חזרה

source: Confirmation
he_il: אישור

source: Do you want to clear changes you made to document before closing?
he_il: האם למחוק נתונים ללא שמירה ?

source: If you don't save, your changes will be lost
he_il: אם לא תשמור, השינויים שלך יאבדו

source: YES
he_il: כן

source: NO
he_il: לא נמצאו תוצאות

source: Display
he_il: לְהַצִיג

source: entries
he_il: רשומות

source: No data found
he_il: לא נמצאו תוצאות

source: Showing page
he_il: מציג

source: Previous
he_il: קודם

source: Next
he_il: הבא

source: Please enter a date in the format dd/mm/yyyy
he_il: אנא הכנס תאריך בפורמט dd/mm/yyyy

source: Please enter LLC Number
he_il: אנא הכנס ת.ז. או ח.פ.

source: History
he_il: היסטוריה

source: Type
he_il: סוג

source: All
he_il: את כל

source: Create Date
he_il: תאריך יצירה

source: Date
he_il: תאריך

source: Dashboard
he_il: ראשי

source: Logout
he_il: יציאה

source: Welcome
he_il: ברוך הבא

source: NBFI System
he_il: קרדיט - מערכת שיתוף מידע

source: New Loan
he_il: הלוואה חדשה

source: View Loan
he_il: הצג הלוואה

source: ID
he_il: .ת.ז

source: Phone
he_il: טלפון

source: Start Date
he_il: תאריך יצירה

source: Surety
he_il: ערבים

source: SAVE
he_il: שמירה

source: Please enter due amount
he_il: אנא הכנס תאריך פרעון

source: Please enter only digits
he_il: מספרים בלבד

source: Please enter phone number
he_il: חסר מספר טלפון

source: Please Login To Enter
he_il: אנא התחבר

source: Enter Email ID
he_il: הזן כתובת אימייל

source: Enter Password
he_il: הזן סיסמא

source: Remember Me
he_il: זכור אותי

source: Login
he_il: כניסה

source: Please enter email
he_il: נא להזין את הדוא"ל

source: Please enter password
he_il: חסר סיסמא

source: Currency rates
he_il: שערים

source: RSS FEED
he_il: חדשות

source: Consumer and market share
he_il: נתח לצרכן בשוק

source: Accountability
he_il: דין וחשבון

source: Wall Street and world markets
he_il: וול סטריט ושוקי עולם

source: Search
he_il: חיפוש

source: Search in last 30days
he_il: חיפושים בחודש

source: Search in last 7days
he_il: חיפושים בשבוע

source: # Offices
he_il: מספר משרדים

source: Guarantor 2
he_il: ערב 2

source: Guarantor 1
he_il: ערב 1

source: Inserted Date
he_il: תאריך הוספה

source: LLC Number
he_il: ח.פ / ת.ז

source: Reporting Comments
he_il: הערות

source: Office reported
he_il: משרד דיווח

source: No reporting comments yet.
he_il: אין דיווח

source: Print
he_il: הדפסה

source: Subject
he_il: נושא

source: Message
he_il: הודעה

source: Send
he_il: שלח

source: Please enter subject
he_il: הכנס נושא

source: Please enter message
he_il: הזן הודעה

source: New User
he_il: משתמש חדש

source: View User
he_il: הצג משתמש

source: User Name
he_il: שם

source: Email
he_il: אימייל

source: Password
he_il: הזן סיסמא

source: Delete User
he_il: מחק משתמש

source: Please enter User Name
he_il: הכנס שם משתמש

source: Please enter email id
he_il: הכנס כתובת אימייל

source: DELETE
he_il: מחק

source: Add User
he_il: משתמש חדש

source: User will permanent delete are you sure ?
he_il: האם אתה בטוח למחוק את משתמש זה ?

source: Additional information
he_il: מידע נוסף

source: File
he_il: קובץ

source: Previous exceptions
he_il: קודם
